benchmark/results/run_20260123_144124/homepage.txt
Running 30s test @ http://127.0.0.1:8080/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.39ms    4.76ms  17.71ms   34.94%
    Req/Sec     4.74k   259.25     5.55k    72.25%
  Latency Distribution
     50%    5.94ms
     75%   10.05ms
     90%   11.07ms
     99%   12.58ms
  565912 requests in 30.00s, 140.01MB read
Requests/sec:  18861.81
Transfer/sec:      4.67MB