benchmark/results/run_20260123_144124/large_file.txt
Running 30s test @ http://127.0.0.1:8080/static/large.html
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.11ms   14.65ms 118.51ms   36.05%
    Req/Sec     1.59k   125.93     2.37k    85.75%
  Latency Distribution
     50%   16.95ms
     75%   30.38ms
     90%   32.31ms
     99%   36.04ms
  189752 requests in 30.01s, 17.71GB read
Requests/sec:   6322.53
Transfer/sec:    604.43MB